{
    "title": "Slack Standalone Preferences",
    "description": "Preferences for Managing pkg based installs of Slack",
    "__version": "1.0",
    "__preferencedomain": "com.tinyspeck.slackmacgap",
    "options": {
        "remove_empty_properties": true
    },
    "properties": {
        "AutoUpdate": {
            "title": "Disable Auto Updates",
            "description": "(AutoUpdate)-Disables Auto Updates",
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "boolean"
                }
            ]
        },
        "SlackDefaultSignInWorkspace": {
            "title": "Default Sign-in Workspace",
            "description": "(SlackDefaultSignInWorkspace)-Default Workspae ID",
            "links": [
                {
                    "rel": "Documentation Link",
                    "href": "https://slack.com/help/articles/360041725993-Share-a-default-sign-in-file-with-members"
                }
            ],
            "anyOf": [
                {
                    "type": "null",
                    "title": "Not Configured"
                },
                {
                    "title": "Configured",
                    "type": "string",
                    "options": {
                        "inputAttributes": {
                            "placeholder": "Workspace ID From Sign-in File"
                        }
                    }
                }
            ]
        }
    }
}
